BankXml/RTGS_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns3:getStrukturaRtgsNalogaRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://strukturaRtgsNaloga.xml.com" xmlns:ns4="http://mt102.xml.com" xmlns:ns5="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>U3V+q0mm3DgkQvqfpLbo/tBJxVaHF/+jt/MiQ/z02i7GPJg4yM4BZo0OuMvLBnSkaoppf4fXq52x&#13;
ERyzW0uR8JtknTQlCPw9g2QIFYzrV10RylACnLloWqi40C87aX+fOlguQqCkT64k15p8eO3t9e5P&#13;
6vUo7RF5mxV0x7n6kpivF7sGa4CmFfzIOCxSTkYcoKugrKqXxVq8rZIC9wGf99eL+AprvQntuzrw&#13;
i1xw8HmH4w9Vn7J7q6Z7be131ZXr1frjOKgCyx1t4wFg1qGbShzj/L4y7kbNs0XsqwCKzpMU7606&#13;
AH4GtLclcwcSb9v9alXbKhXE+SSRCaaVBrHQeQ==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>x1aEyC13xen+F/aN5jXTt46nLiukPNvZiNJs57CHV35M8GolzEknz8ZsqLjORKbZf6jnKGxny8dr&#13;
cOazvgksh6BKl1MKuNfMUV6YgW6O+lWPsva8xRw4gbq+sOYjxXpQOJbE88yq2LOommhMHzaCfQ3Y&#13;
a2Rqt7uKGpzUmv7aZKAjXBvCTX3hpR0HeDcf137lVd9FujKAk9Di4ne3W111zOTu7Drs/Prhh5Uh&#13;
7XxR1gu53xxY7sRw4Z19hfEcbt4+V3ItXz75rfWUGTxh1DljQHcuHKP843adePGqfBSAaHc/aLqF&#13;
7lx3axN/t6Z4tcvg/DYkJf7D5roHBRZSX3Ug8h6uPKU7c3uhoMZpBUGUSIJk8KiMQMwOiGjCKU4x&#13;
QjHgLdgyEtUV0YYpJkkWsBN6hhXYzeUfpE0ZBjv5POB7bizk/iWU0fYwz1/SEO7pL700r2STqmJp&#13;
TgBUK4PWZo+TyzJuJbbEo4zmuHV36BfuEPsmsNLb/gpmazzUpWh0gZCnyDbRVj7UN+20eT0uPiXq&#13;
a0Q/u3EqJ26nY65phf6KE4b07xDNC/wLDskR5Pb8Vewmm/9FldtomMzAFWZOeD7wWKrbUn+82vwn&#13;
j8pOqm9w8fUrMG52Voignt/zKowJpgLhqfYZ/IieDohi3qcLZyCxeXATNEEwMcms+/j356oukQ+l&#13;
1Jw95QEi3IGMUCb6vhQLZ4tj0zJRs+BIbb0G09ZioJ/bixWzMegQyH9KEE1QNAxcTva1NlmY0x9i&#13;
ggw6riGQTvf8sYB88oae0QjCETd54xmD4uBYfy1NNzN1r5AbQLe/3RI/MjwVobtVwBFcDfuBWOtS&#13;
lhw9ePdqfz7jOBxu5WEFbRMIxBp/49il9mzKoeVTc/0tVtmLEgACpf7kEPdcmEZddljN6B/KWNod&#13;
tik3lsWG77OHKMNd4Gg2h50ramTsR8PaZx5OfpmPZ+c07CVjgVS6y4AWV8mwXPE4GSNvITnlbR5d&#13;
jRLBSHLrR/Per0kYM2bRIDeXzaDVkbOaUKxllgbqXtzLDq5Z/Imn0NUheYXerIZGV7Wb6Mpo6Ktl&#13;
BWm0TLPNloV7J2ZwY5oF9fH/bEDUErrnntwZLABQGbqy8FLAIdi+FfyqOLrPFah+7Cxi7fBirZ9I&#13;
4pvchbwBDpc8Oqyr+4vUCqThqMb5PdnCd650tR0G/YJHpv1wxihMSv1iI0VR80/1Yg9/eJ6/qvXL&#13;
2UzfJZXeBe1KUDCVZQinmcu6VHuGtzMf0WSsYteh5kh5d3x+qjTwOAj2hiHIqYSPyFlV5ut/QbFp&#13;
vpj8RZVFD+ug+8yH7ygCDeu21/c5Z5h1ym/SGBWw6OSYemfhwEdcaui3AawqzKOC720jNpVNeQ==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns3:getStrukturaRtgsNalogaRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>KYYowDz9baZMITl9mSGfGFUkJdw=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
JeV85dmbdSnFgOipdE5f0hO6b3D5VtOAev5xphQFzUzvQhDAWbNAm3p+LVVdC+4qp7/QlrDASdDY&#13;
+79DAsVuo2C8I+N3r67LXVaEIhbi7RktyviKxSNjUxrAP27idyYTlj27s13n4FTwuGkPYgA1z6ox&#13;
dX/yNdHX0Z/40HJ92ZByDe03kNdOIsluWPuNzBvdH6tit+uQ7VCdFSDIdb5lQmaCqi8jUhLnKUit&#13;
/csmFH3MUjkAW9bCi/97iaaKt7MYALGF9vbaV1bUfo/ENzLRT7k50qKx/Ie34VlTXjv+uNGmUdXN&#13;
P94Ivpmmb1svqEvsVPHo7L1sclUMcAyT7lA4/w==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iYFqE4e3bUjAttedcKZSAisg5+YICC8Yf0MmjWxsj5XjlN5kZN6T1RC6zXYH7U2nokaxjGxEeKvq&#13;
gvCJfwiBo+t2lGFyaOU3dietqZWr0scIpm0rVoazZPgCzo3PPK1VBWpyOA7/1UZpPJYxIoQq0ZrR&#13;
NGJPIKLff/UQtyjgf1AQZN7+6Ey5MKfG0NNQtvoO8AgL0CGe81+ziZ7GjbIR11OodRAkFxSz7xeb&#13;
DWOWK5L1jDwPPkyoFpyybsD45Vld/1z0M6kDFzyCm/ha37vqGBBGSKudUVztnMY/jwo9ja3Yd93Q&#13;
3Pe2lZfRAj5qykiOd8WEq4KDJ7/zWU1f0nsu5Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDoDCCAoigAwIBAgIEWUhQxDANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQD&#13;
DAdCYW5rYSBBMRAwDgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3Ji&#13;
MRowGAYJKoZIhvcNAQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIw&#13;
ggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCJgWoTh7dtSMC2151wplICKyDn5ggILxh/&#13;
QyaNbGyPleOU3mRk3pPVELrNdgftTaeiRrGMbER4q+qC8Il/CIGj63aUYXJo5Td2J62plavSxwim&#13;
bStWhrNk+ALOjc88rVUFanI4Dv/VRmk8ljEihCrRmtE0Yk8got9/9RC3KOB/UBBk3v7oTLkwp8bQ&#13;
01C2+g7wCAvQIZ7zX7OJnsaNshHXU6h1ECQXFLPvF5sNY5YrkvWMPA8+TKgWnLJuwPjlWV3/XPQz&#13;
qQMXPIKb+Frfu+oYEEZIq51RXO2cxj+PCj2Nrdh33dDc97aVl9ECPmrKSI53xYSrgoMnv/NZTV/S&#13;
ey7lAgMBAAGjEzARMA8GA1UdEwEB/wQFMAMBAf8wDQYJKoZIhvcNAQELBQADggEBAG97A295MjBs&#13;
W9KAIx7/VlBabr8edSQbwNqaLPJLT5LeXqrCTaBeBstdUnbxRCduSIoV96h3+ogy22lBm5viOXER&#13;
psHpIRtjoSogXu79aPwGuXfh9ZwcJ0snkOpAC1eITJK2j1gOzT/dj8SY5RP7ptosw0o6HwgzyljK&#13;
O1eNN5AunHsAjCkJMn1eyJJW8bZkjp3HajxoHM5Y7dGc3GYi018+StfkjZC51kj4ZrjRsklhIrrC&#13;
cbKkMsD/PPaZUN96KbMev6exKS3gXxBkyi/4TKpbNblT60MheU7fWgOodF9bswi0x31dftQibjms&#13;
lxmeTI40cje1sxblOwNPGNOc0OA=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>